A=["飢餓遊戲3","解憂雜貨店","怪獸與他們的產地","哈利波特6","我的阿富汗筆友","祈念之樹","樓下的房客","小王子"]
B=["房思琪的初戀樂園","等一個人咖啡","鬼滅之刃14","神農嘗百草","麥田捕手","老人與海","傲慢與偏見","與神同行"]
for i in range(len(A)):
    a=(input("請輸入欲租借的書籍:"))
    if a=="飢餓遊戲3":
        print("在書架A的第",A.index("飢餓遊戲3")+1,"本")
    elif a=="解憂雜貨店":
        print("在書架A的第",A.index("解憂雜貨店")+1,"本")
    elif a=="怪獸與他們的產地":
        print("在書架A的第",A.index("怪獸與他們的產地")+1,"本")
    elif a=="哈利波特6":
        print("在書架A的第",A.index("哈利波特6")+1,"本")
    elif a=="我的阿富汗筆友":
        print("在書架A的第",A.index("我的阿富汗筆友")+1,"本")
    elif a=="祈念之樹":
        print("在書架A的第",A.index("祈念之樹")+1,"本")
    elif a=="樓下的房客":
        print("在書架A的第",A.index("樓下的房客")+1,"本")
    elif a=="小王子":
        print("在書架A的第",A.index("小王子")+1,"本")
    elif a=="房思琪的初戀樂園":
        print("在書架B的第",B.index("房思琪的初戀樂園")+1,"本")
    elif a=="等一個人咖啡":
        print("在書架B的第",B.index("等一個人咖啡")+1,"本")
    elif a=="鬼滅之刃14":
        print("在書架B的第",B.index("鬼滅之刃14")+1,"本")
    elif a=="神農嘗百草":
        print("在書架B的第",B.index("神農嘗百草")+1,"本")
    elif a=="麥田捕手":
        print("在書架B的第",B.index("麥田捕手")+1,"本")
    elif a=="老人與海":
        print("在書架B的第",B.index("老人與海")+1,"本")
    elif a=="傲慢與偏見":
        print("在書架B的第",B.index("傲慢與偏見")+1,"本")
    elif a=="與神同行":
        print("在書架B的第",B.index("與神同行")+1,"本")
    else:
        print("查無此書籍")